dany994/vak-opensource/trunk/microcontrollers/pic32proxy/target-pic32mx.c
/*
 * Interface to debug port of PIC32 microcontroller.
 * This file is independent of any JTAG or ICSP adapter used.
 * Codelets borrowed from OpenOCD project.
 *
 * Copyright (C) 2012 Serge Vakulenko
 *
 * This file is part of PIC32PROXY project, which is distributed
 * under the terms of the GNU General Public License (GPL).
 * See the accompanying file "COPYING" for more details.
 */
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdarg.h>
#include <time.h>
#include <unistd.h>
#include <signal.h>
#include <errno.h>

#include "target.h"
#include "adapter.h"
#include "mips.h"
#include "pic32.h"

#define ARRAY_SIZE(x) (sizeof(x) / sizeof(*(x)))

struct _target_t {
    adapter_t   *adapter;
    const char  *cpu_name;
    unsigned    cpuid;
    unsigned    is_running;
    unsigned    flash_kbytes;
    unsigned    boot_kbytes;

    unsigned    reg [38];
#define REG_STATUS      32      /* Should match GDB. */
#define REG_LO          33
#define REG_HI          34
#define REG_BADVADDR    35
#define REG_CAUSE       36
#define REG_DEPC        37

    unsigned    dcr;                    /* Debug control register. */
    int         dcr_valid;
    unsigned    nbpoints;               /* Number of hardware breakpoints. */
    unsigned    bp_value [15];
    int         bp_used [15];
    unsigned    nwatchpoints;           /* Number of hardware watchpoints. */
    unsigned    watch_value [15];
    int         watch_used [15];
};

static target_t *target_current;        /* For sigint handler */

static const struct {
    unsigned devid;
    const char *name;
    unsigned flash_kbytes;
    unsigned boot_kbytes;
} pic32mx_dev[] = {
    {0x4A07053, "MX110F016B",  16,  3},
    {0x4A09053, "MX110F016C",  16,  3},
    {0x4A0B053, "MX110F016D",  16,  3},
    {0x4A06053, "MX120F032B",  32,  3},
    {0x4A08053, "MX120F032C",  32,  3},
    {0x4A0A053, "MX120F032D",  32,  3},
    {0x4D07053, "MX130F064B",  64,  3},
    {0x4D09053, "MX130F064C",  64,  3},
    {0x4D0B053, "MX130F064D",  64,  3},
    {0x4D06053, "MX150F128B", 128,  3},
    {0x4D08053, "MX150F128C", 128,  3},
    {0x4D0A053, "MX150F128D", 128,  3},
    {0x4A01053, "MX210F016B",  16,  3},
    {0x4A03053, "MX210F016C",  16,  3},
    {0x4A05053, "MX210F016D",  16,  3},
    {0x4A00053, "MX220F032B",  32,  3},
    {0x4A02053, "MX220F032C",  32,  3},
    {0x4A04053, "MX220F032D",  32,  3},
    {0x4D01053, "MX230F064B",  64,  3},
    {0x4D03053, "MX230F064C",  64,  3},
    {0x4D05053, "MX230F064D",  64,  3},
    {0x4D00053, "MX250F128B", 128,  3},
    {0x4D02053, "MX250F128C", 128,  3},
    {0x4D04053, "MX250F128D", 128,  3},
    {0x0938053, "MX360F512L", 512, 12},
    {0x0934053, "MX360F256L", 256, 12},
    {0x092D053, "MX340F128L", 128, 12},
    {0x092A053, "MX320F128L", 128, 12},
    {0x0916053, "MX340F512H", 512, 12},
    {0x0912053, "MX340F256H", 256, 12},
    {0x090D053, "MX340F128H", 128, 12},
    {0x090A053, "MX320F128H", 128, 12},
    {0x0906053, "MX320F064H",  64, 12},
    {0x0902053, "MX320F032H",  32, 12},
    {0x0978053, "MX460F512L", 512, 12},
    {0x0974053, "MX460F256L", 256, 12},
    {0x096D053, "MX440F128L", 128, 12},
    {0x0952053, "MX440F256H", 256, 12},
    {0x0956053, "MX440F512H", 512, 12},
    {0x094D053, "MX440F128H", 128, 12},
    {0x0942053, "MX420F032H",  32, 12},
    {0x4307053, "MX795F512L", 512, 12},
    {0x430E053, "MX795F512H", 512, 12},
    {0x4306053, "MX775F512L", 512, 12},
    {0x430D053, "MX775F512H", 512, 12},
    {0x4312053, "MX775F256L", 256, 12},
    {0x4303053, "MX775F256H", 256, 12},
    {0x4417053, "MX764F128L", 128, 12},
    {0x440B053, "MX764F128H", 128, 12},
    {0x4341053, "MX695F512L", 512, 12},
    {0x4325053, "MX695F512H", 512, 12},
    {0x4311053, "MX675F512L", 512, 12},
    {0x430C053, "MX675F512H", 512, 12},
    {0x4305053, "MX675F256L", 256, 12},
    {0x430B053, "MX675F256H", 256, 12},
    {0x4413053, "MX664F128L", 128, 12},
    {0x4407053, "MX664F128H", 128, 12},
    {0x4411053, "MX664F064L",  64, 12},
    {0x4405053, "MX664F064H",  64, 12},
    {0x430F053, "MX575F512L", 512, 12},
    {0x4309053, "MX575F512H", 512, 12},
    {0x4333053, "MX575F256L", 256, 12},
    {0x4317053, "MX575F256H", 256, 12},
    {0x440F053, "MX564F128L", 128, 12},
    {0x4403053, "MX564F128H", 128, 12},
    {0x440D053, "MX564F064L",  64, 12},
    {0x4401053, "MX564F064H",  64, 12},
    {0x4400053, "MX534F064H",  64, 12},
    {0x440C053, "MX534F064L",  64, 12},
    {0}
};

#if defined (__CYGWIN32__) || defined (MINGW32)
/*
 * Delay in milliseconds: Windows.
 */
#include <windows.h>

void mdelay (unsigned msec)
{
    Sleep (msec);
}
#else
/*
 * Delay in milliseconds: Unix.
 */
void mdelay (unsigned msec)
{
    usleep (msec * 1000);
}
#endif

static void target_sigint (int sig)
{
    printf ("\nInterrupted by user.\n");
    if (target_current) {
        target_current->adapter->close (target_current->adapter, 0);
    }
    exit (0);
}

/*
 * Save the state of CPU.
 */
static void target_save_state (target_t *t)
{
    static const unsigned code[] = {                /* start: */
        MIPS_MTC0 (2, 31, 0),                       /* move $2 to COP0 DeSave */
        MIPS_LUI (2, UPPER16(PRACC_PARAM_OUT)),     /* $2 = PRACC_PARAM_OUT */
        MIPS_ORI (2, 2, LOWER16(PRACC_PARAM_OUT)),
        MIPS_SW (0, 0*4, 2),                        /* sw $0,0*4($2) */
        MIPS_SW (1, 1*4, 2),                        /* sw $1,1*4($2) */
        MIPS_SW (15, 15*4, 2),                      /* sw $15,15*4($2) */
        MIPS_MFC0 (2, 31, 0),                       /* move COP0 DeSave to $2 */
        MIPS_MTC0 (15, 31, 0),                      /* move $15 to COP0 DeSave */
        MIPS_LUI (15, UPPER16(PRACC_STACK)),        /* $15 = PRACC_STACK */
        MIPS_ORI (15, 15, LOWER16(PRACC_STACK)),
        MIPS_SW (1, 0, 15),                         /* sw $1,($15) */
        MIPS_SW (2, 0, 15),                         /* sw $2,($15) */
        MIPS_LUI (1, UPPER16(PRACC_PARAM_OUT)),     /* $1 = PRACC_PARAM_OUT */
        MIPS_ORI (1, 1, LOWER16(PRACC_PARAM_OUT)),
        MIPS_SW (2, 2*4, 1),                        /* sw $2,2*4($1) */
        MIPS_SW (3, 3*4, 1),                        /* sw $3,3*4($1) */
        MIPS_SW (4, 4*4, 1),                        /* sw $4,4*4($1) */
        MIPS_SW (5, 5*4, 1),                        /* sw $5,5*4($1) */
        MIPS_SW (6, 6*4, 1),                        /* sw $6,6*4($1) */
        MIPS_SW (7, 7*4, 1),                        /* sw $7,7*4($1) */
        MIPS_SW (8, 8*4, 1),                        /* sw $8,8*4($1) */
        MIPS_SW (9, 9*4, 1),                        /* sw $9,9*4($1) */
        MIPS_SW (10, 10*4, 1),                      /* sw $10,10*4($1) */
        MIPS_SW (11, 11*4, 1),                      /* sw $11,11*4($1) */
        MIPS_SW (12, 12*4, 1),                      /* sw $12,12*4($1) */
        MIPS_SW (13, 13*4, 1),                      /* sw $13,13*4($1) */
        MIPS_SW (14, 14*4, 1),                      /* sw $14,14*4($1) */
        MIPS_SW (16, 16*4, 1),                      /* sw $16,16*4($1) */
        MIPS_SW (17, 17*4, 1),                      /* sw $17,17*4($1) */
        MIPS_SW (18, 18*4, 1),                      /* sw $18,18*4($1) */
        MIPS_SW (19, 19*4, 1),                      /* sw $19,19*4($1) */
        MIPS_SW (20, 20*4, 1),                      /* sw $20,20*4($1) */
        MIPS_SW (21, 21*4, 1),                      /* sw $21,21*4($1) */
        MIPS_SW (22, 22*4, 1),                      /* sw $22,22*4($1) */
        MIPS_SW (23, 23*4, 1),                      /* sw $23,23*4($1) */
        MIPS_SW (24, 24*4, 1),                      /* sw $24,24*4($1) */
        MIPS_SW (25, 25*4, 1),                      /* sw $25,25*4($1) */
        MIPS_SW (26, 26*4, 1),                      /* sw $26,26*4($1) */
        MIPS_SW (27, 27*4, 1),                      /* sw $27,27*4($1) */
        MIPS_SW (28, 28*4, 1),                      /* sw $28,28*4($1) */
        MIPS_SW (29, 29*4, 1),                      /* sw $29,29*4($1) */
        MIPS_SW (30, 30*4, 1),                      /* sw $30,30*4($1) */
        MIPS_SW (31, 31*4, 1),                      /* sw $31,31*4($1) */

        MIPS_MFC0 (2, 12, 0),                       /* move status to $2 */
        MIPS_SW (2, 32*4, 1),                       /* sw $2,32*4($1) */
        MIPS_MFLO (2),                              /* move lo to $2 */
        MIPS_SW (2, 33*4, 1),                       /* sw $2,33*4($1) */
        MIPS_MFHI (2),                              /* move hi to $2 */
        MIPS_SW (2, 34*4, 1),                       /* sw $2,34*4($1) */
        MIPS_MFC0 (2, 8, 0),                        /* move badvaddr to $2 */
        MIPS_SW (2, 35*4, 1),                       /* sw $2,35*4($1) */
        MIPS_MFC0 (2, 13, 0),                       /* move cause to $2 */
        MIPS_SW (2, 36*4, 1),                       /* sw $2,36*4($1) */
        MIPS_MFC0 (2, 24, 0),                       /* move depc (pc) to $2 */
        MIPS_SW (2, 37*4, 1),                       /* sw $2,37*4($1) */

        MIPS_LW (2, 0, 15),                         /* lw $2,($15) */
        MIPS_LW (1, 0, 15),                         /* lw $1,($15) */
        MIPS_B (NEG16(58)),                         /* b start */
        MIPS_MFC0 (15, 31, 0),                      /* move COP0 DeSave to $15 */
    };

