dany994/vak-opensource/trunk/microcontrollers/pic32proxy/target-pic32mx.c
    t->adapter->exec (t->adapter, 1, ARRAY_SIZE(code), code,
        0, 0, ARRAY_SIZE(t->reg), t->reg);

    if (! t->dcr_valid) {
        /* Get the parameters of debug block. */
        t->dcr = target_read_word (t, EJTAG_DCR);
        t->dcr_valid = 1;
        //fprintf (stderr, "DCR = %08x\n", t->dcr);

        if (t->dcr & DCR_INSTBRK) {
            /* Instruction breakpoints supported.
             * Get number of inst breakpoints.
             * Clear break status. */
            unsigned ibs = target_read_word (t, EJTAG_IBS);
            target_write_word (t, EJTAG_IBS, 0);

            t->nbpoints = (ibs >> 24) & 0x0F;
            //fprintf (stderr, "IBS = %08x, %u instruction breakpoints\n", ibs, t->nbpoints);
        }
        if (t->dcr & DCR_DATABRK) {
            /* Data breakpoints supported.
             * Get number of data breakpoints.
             * Clear break status. */
            unsigned dbs = target_read_word (t, EJTAG_DBS);
            target_write_word (t, EJTAG_DBS, 0);

            t->nwatchpoints = (dbs >> 24) & 0x0F;
            //fprintf (stderr, "DBS = %08x, %u watchpoints\n", dbs, t->nwatchpoints);
        }
        printf ("Debug hardware: %u breakpoints, %u watchpoints\n",
            t->nbpoints, t->nwatchpoints);
    }
}

/*
 * Connect to JTAG adapter.
 * Must stop a processor, but avoid resetting it, if possible.
 */
target_t *target_open ()
{
    target_t *t;

    t = calloc (1, sizeof (target_t));
    if (! t) {
        fprintf (stderr, "Out of memory\n");
        exit (-1);
    }
    t->cpu_name = "Unknown";

    /* Find adapter. */
    t->adapter = adapter_open_pickit ();
#ifdef USE_MPSSE
    if (! t->adapter)
        t->adapter = adapter_open_mpsse ();
#endif
    if (! t->adapter) {
        fprintf (stderr, "No target found.\n");
        exit (-1);
    }
    target_current = t;
    signal (SIGINT, target_sigint);

    /* Check CPU identifier. */
    t->cpuid = t->adapter->get_idcode (t->adapter);
    if (t->cpuid == 0 || t->cpuid == ~0) {
        /* Device not detected. */
        fprintf (stderr, "Bad CPUID=%08x.\n", t->cpuid);
        t->adapter->close (t->adapter, 0);
        exit (1);
    }
    unsigned i;
    for (i=0; (t->cpuid ^ pic32mx_dev[i].devid) & 0x0fffffff; i++) {
        if (pic32mx_dev[i].devid == 0) {
            /* Device not detected. */
            fprintf (stderr, "Unknown CPUID=%08x.\n", t->cpuid);
            t->adapter->close (t->adapter, 0);
            exit (1);
        }
    }
    t->cpu_name = pic32mx_dev[i].name;
    t->flash_kbytes = pic32mx_dev[i].flash_kbytes;
    t->boot_kbytes = pic32mx_dev[i].boot_kbytes;
    printf ("Processor: %s\n", t->cpu_name);

    /* Stop the processor. */
    t->adapter->stop_cpu (t->adapter);
    target_save_state (t);
    return t;
}

/*
 * Close the device.
 */
void target_close (target_t *t, int power_on)
{
    t->adapter->close (t->adapter, power_on);
    target_current = 0;
}

const char *target_cpu_name (target_t *t)
{
    return t->cpu_name;
}

unsigned target_idcode (target_t *t)
{
    return t->cpuid;
}

/*
 * Read a register:
 *      0-31  - GPRs
 *      32    - CP0 Status
 *      33    - LO
 *      34    - HI
 *      35    - CP0 BadVAddr
 *      36    - CP0 Cause
 *      37    - PC
 * FPU registers not supported for PIC32.
 */
unsigned target_read_register (target_t *t, unsigned regno)
{
    //fprintf (stderr, "target_read_register (regno = %u)\n", regno);
    if (regno < 32) {
        /* General purpose registers */
        return t->reg [regno];
    }
    switch (regno) {
    case REG_STATUS:
    case REG_LO:
    case REG_HI:
    case REG_BADVADDR:
    case REG_CAUSE:
    case REG_DEPC:
        return t->reg [regno];
    }
    return 0;
}

/*
 * The processor is running: stop it.
 */
void target_stop (target_t *t)
{
    if (! t->is_running)
        return;
    t->adapter->stop_cpu (t->adapter);
    t->is_running = 0;
    target_save_state (t);
}

/*
 * The processor is supposedly running: check if it has been stopped.
 * Return 1 when stopped or 0 if still running.
 */
int target_is_stopped (target_t *t, int *is_aborted)
{
    *is_aborted = 0;

    /* Tiny delay. */
    mdelay (100);
    if (! t->adapter->cpu_stopped (t->adapter))
        return 0;

    /* Stopped. */
    if (t->is_running) {
        t->is_running = 0;
        target_save_state (t);
    }
#if 0
    /* TODO: BREAKD instruction detected. */
    if (t->adapter->oscr & OSCR_SWO)
        *is_aborted = 1;
#endif
    return 1;
}

/*
 * The processor is stopped: let it run.
 */
void target_resume (target_t *t)
{
    static const unsigned code[] = {
        MIPS_DRET,                            /* return from debug mode */
    };

    if (t->is_running)
        return;
    t->is_running = 1;
    t->adapter->exec (t->adapter, 0, ARRAY_SIZE(code), code, 0, 0, 0, 0);
}

/*
 * The processor is stopped: start it from the given address.
 */
void target_run (target_t *t, unsigned addr)
{
    static const unsigned code[] = {
	MIPS_MTC0 (15, 31, 0),                      /* move $15 to COP0 DeSave */
	MIPS_LUI (15, UPPER16(PRACC_PARAM_IN)),     /* $15 = PRACC_PARAM_IN */
	MIPS_LW (15, LOWER16(PRACC_PARAM_IN), 15),  /* $15 = addr */
	MIPS_MTC0 (15, 24, 0),                      /* move $15 to COP0 DEPC */
	MIPS_MFC0 (15, 31, 0),                      /* move COP0 DeSave to $15 */
        MIPS_DRET,                                  /* return from debug mode */
    };

    if (t->is_running)
        return;

    t->is_running = 1;
    t->adapter->exec (t->adapter, 0, ARRAY_SIZE(code), code, 1, &addr, 0, 0);
}

/*
 * Restart the processor, using hardware reset.
 */
void target_restart (target_t *t)
{
    t->adapter->reset_cpu (t->adapter);
    t->is_running = 1;
}

/*
 * The processor is stopped: run it for one instruction only.
 */
void target_step (target_t *t)
{
    static const unsigned code_step[] = {
        MIPS_MTC0 (1, 31, 0),			/* move $1 to COP0 DeSave */
        MIPS_MFC0 (1, 23, 0),			/* move COP0 Debug to $1 */
        MIPS_ORI (1, 1, 0x0100),		/* set SSt bit in debug reg */
        MIPS_MTC0 (1, 23, 0),			/* move $1 to COP0 Debug */
        MIPS_MFC0 (1, 31, 0),			/* move COP0 DeSave to $1 */
        MIPS_DRET,                              /* return from debug mode */
    };
    static const unsigned code_step_disable[] = {
        MIPS_MTC0 (15, 31, 0),                  /* move $15 to COP0 DeSave */
        MIPS_LUI (15, UPPER16(PRACC_STACK)),    /* $15 = PRACC_STACK */
        MIPS_ORI (15, 15, LOWER16(PRACC_STACK)),
        MIPS_SW (1, 0, 15),			/* sw $1,($15) */
        MIPS_SW (2, 0, 15),			/* sw $2,($15) */
        MIPS_MFC0 (1, 23, 0),			/* move COP0 Debug to $1 */
        MIPS_LUI (2, 0xFFFF),			/* $2 = 0xfffffeff */
        MIPS_ORI (2, 2, 0xFEFF),
        MIPS_AND (1, 1, 2),
        MIPS_MTC0 (1, 23, 0),			/* move $1 to COP0 Debug */
        MIPS_LW (2, 0, 15),
        MIPS_LW (1, 0, 15),
        MIPS_B (NEG16(13)),
        MIPS_MFC0 (15, 31, 0),                  /* move COP0 DeSave to $15 */
    };

