dany994/vak-opensource/trunk/microcontrollers/pic32proxy/target-pic32mx.c
    if (t->is_running)
        return;

    t->adapter->exec (t->adapter, 1,
        ARRAY_SIZE(code_step), code_step, 0, 0, 0, 0);
    target_save_state (t);

    t->adapter->exec (t->adapter, 1,
        ARRAY_SIZE(code_step_disable), code_step_disable, 0, 0, 0, 0);
}

/*
 * Read data from memory.
 */
unsigned target_read_word (target_t *t, unsigned addr)
{
    static const unsigned code[] = {            /* start: */
        MIPS_MTC0 (15, 31, 0),                  /* move $15 to COP0 DeSave */
        MIPS_LUI (15, UPPER16(PRACC_STACK)),	/* $15 = PRACC_STACK */
        MIPS_ORI (15, 15, LOWER16(PRACC_STACK)),
        MIPS_SW (8, 0, 15),			/* sw $8,($15) */

        MIPS_LW (8, NEG16(PRACC_STACK - PRACC_PARAM_IN), 15), /* load R8 @ param_in[0] = address */

        MIPS_LW (8, 0, 8),			/* lw $8,0($8), Load $8 with the word @mem[$8] */
        MIPS_SW (8, NEG16(PRACC_STACK - PRACC_PARAM_OUT), 15), /* store R8 @ param_out[0] */

        MIPS_LW (8, 0, 15),			/* lw $8,($15) */
        MIPS_B (NEG16(9)),			/* b start */
        MIPS_MFC0 (15, 31, 0),                  /* move COP0 DeSave to $15 */
    };
    unsigned word;

    t->adapter->exec (t->adapter, 1,
        ARRAY_SIZE(code), code, 1, &addr, 1, &word);
    return word;
}

void target_read_block (target_t *t, unsigned addr,
    unsigned nwords, unsigned *data)
{
    if (nwords == 1) {
        *data = target_read_word (t, addr);
        return;
    }

    static const unsigned code[] = {            /* start: */
        MIPS_MTC0 (15, 31, 0),                  /* move $15 to COP0 DeSave */
        MIPS_LUI (15, UPPER16(PRACC_STACK)),	/* $15 = PRACC_STACK */
        MIPS_ORI (15, 15, LOWER16(PRACC_STACK)),
        MIPS_SW (8, 0, 15),			/* sw $8,($15) */
        MIPS_SW (9, 0, 15),			/* sw $9,($15) */
        MIPS_SW (10, 0, 15),			/* sw $10,($15) */
        MIPS_SW (11, 0, 15),			/* sw $11,($15) */

        MIPS_LUI (8, UPPER16(PRACC_PARAM_IN)),  /* $8 = PRACC_PARAM_IN */
        MIPS_ORI (8, 8, LOWER16(PRACC_PARAM_IN)),
        MIPS_LW (9, 0, 8),			/* $9 = mem[$8]; read addr */
        MIPS_LW (10, 4, 8),			/* $10 = mem[$8 + 4]; read nwords */
        MIPS_LUI (11, UPPER16(PRACC_PARAM_OUT)),/* $11 = PRACC_PARAM_OUT */
        MIPS_ORI (11, 11, LOWER16(PRACC_PARAM_OUT)),
                                                /* loop: */
        MIPS_BEQ (0, 10, 8),			/* beq 0, $10, end */
        MIPS_NOP,

        MIPS_LW (8, 0, 9),			/* lw $8,0($9), Load $8 with the word @mem[$9] */
        MIPS_SW (8, 0, 11),			/* sw $8,0($11) */

        MIPS_ADDI (10, 10, NEG16(1)),		/* $10-- */
        MIPS_ADDI (9, 9, 4),			/* $1 += 4 */
        MIPS_ADDI (11, 11, 4),                  /* $11 += 4 */

        MIPS_B (NEG16(8)),			/* b loop */
        MIPS_NOP,
                                                /* end: */
        MIPS_LW (11, 0, 15),			/* lw $11,($15) */
        MIPS_LW (10, 0, 15),			/* lw $10,($15) */
        MIPS_LW (9, 0, 15),			/* lw $9,($15) */
        MIPS_LW (8, 0, 15),			/* lw $8,($15) */
        MIPS_B (NEG16(27)),			/* b start */
        MIPS_MFC0 (15, 31, 0),                  /* move COP0 DeSave to $15 */
    };
    int n, nread;
    unsigned param_in[2];

    nread = 0;
    while (nwords > 0) {
        n = nwords;
        if (nwords > 0x400)
            n = 0x400;

        param_in[0] = addr;
        param_in[1] = n;

        t->adapter->exec (t->adapter, 1, ARRAY_SIZE(code), code,
            ARRAY_SIZE(param_in), param_in, n, &data[nread]);

        nwords -= n;
        addr += n;
        nread += n;
    }
}

/*
 * Write data to memory.
 */
void target_write_word (target_t *t, unsigned addr, unsigned word)
{
    static const unsigned code[] = {            /* start: */
        MIPS_MTC0 (15, 31, 0),                  /* move $15 to COP0 DeSave */
        MIPS_LUI (15, UPPER16(PRACC_STACK)),	/* $15 = PRACC_STACK */
        MIPS_ORI (15, 15, LOWER16(PRACC_STACK)),
        MIPS_SW (8, 0, 15),			/* sw $8,($15) */
        MIPS_SW (9, 0, 15),			/* sw $9,($15) */

        MIPS_LW (8, NEG16((PRACC_STACK - PRACC_PARAM_IN) - 4), 15), /* load R8 @ param_in[1] = data */
        MIPS_LW (9, NEG16(PRACC_STACK - PRACC_PARAM_IN), 15), /* load R9 @ param_in[0] = address */

        MIPS_SW (8, 0, 9),			/* sw $8,0($9) */

        MIPS_LW (9, 0, 15),			/* lw $9,($15) */
        MIPS_LW (8, 0, 15),			/* lw $8,($15) */
        MIPS_B (NEG16(11)),			/* b start */
        MIPS_MFC0 (15, 31, 0),                  /* move COP0 DeSave to $15 */
    };

    unsigned param_in [2];
    param_in[0] = addr;
    param_in[1] = word;

    t->adapter->exec (t->adapter, 1, ARRAY_SIZE(code), code,
        ARRAY_SIZE(param_in), param_in, 0, 0);
}

void target_write_block (target_t *t, unsigned addr,
    unsigned nwords, unsigned *data)
{
    static const unsigned code[] = {            /* start: */
        MIPS_MTC0 (15, 31, 0),                  /* move $15 to COP0 DeSave */
        MIPS_LUI (15, UPPER16(PRACC_STACK)),	/* $15 = PRACC_STACK */
        MIPS_ORI (15, 15, LOWER16(PRACC_STACK)),
        MIPS_SW (8, 0, 15),			/* sw $8,($15) */
        MIPS_SW (9, 0, 15),			/* sw $9,($15) */
        MIPS_SW (10, 0, 15),			/* sw $10,($15) */
        MIPS_SW (11, 0, 15),			/* sw $11,($15) */

        MIPS_ADDI (8, 15, NEG16(PRACC_STACK - PRACC_PARAM_IN)), /* $8= PRACC_PARAM_IN */
        MIPS_LW (9, 0, 8),			/* Load write addr to $9 */
        MIPS_LW (10, 4, 8),			/* Load write count to $10 */
        MIPS_ADDI (8, 8, 8),			/* $8 += 8 beginning of data */
                                                /* loop: */
        MIPS_LW (11, 0, 8),			/* lw $11,0($8), Load $11 with the word @mem[$8] */
        MIPS_SW (11, 0, 9),			/* sw $11,0($9) */

        MIPS_ADDI (9, 9, 4),			/* $9 += 4 */
        MIPS_BNE (10, 9, NEG16(4)),		/* bne $10, $9, loop */
        MIPS_ADDI (8, 8, 4),			/* $8 += 4 */
                                                /* end: */
        MIPS_LW (11, 0, 15),			/* lw $11,($15) */
        MIPS_LW (10, 0, 15),			/* lw $10,($15) */
        MIPS_LW (9, 0, 15),			/* lw $9,($15) */
        MIPS_LW (8, 0, 15),			/* lw $8,($15) */
        MIPS_B (NEG16(21)),			/* b start */
        MIPS_MFC0 (15, 31, 0),                  /* move COP0 DeSave to $15 */
    };

