dany994/vak-opensource/trunk/microcontrollers/pic32proxy/target-pic32mx.c
    if (nwords == 1) {
        target_write_word (t, addr, *data);
        return;
    }

    unsigned param_in [nwords + 2];
    param_in[0] = addr;
    param_in[1] = addr + (nwords * sizeof(unsigned));	/* last address */

    memcpy (&param_in[2], data, nwords * sizeof(unsigned));

    t->adapter->exec (t->adapter, 1, ARRAY_SIZE(code), code,
        nwords + 2, param_in, 0, 0);
}

/*
 * Write a register:
 *      0-31  - GPRs
 *      32    - CP0 Status
 *      33    - LO
 *      34    - HI
 *      35    - CP0 BadVAddr
 *      36    - CP0 Cause
 *      37    - PC
 * FPU registers not supported for PIC32.
 */
void target_write_register (target_t *t, unsigned regno, unsigned val)
{
    static unsigned code_gpr[] = {              /* start: */
        0,                                      /* lui regno, upper_val */
        MIPS_B (NEG16(2)),			/* b start */
        0,                                      /* ori regno, lower_val */
    };
    static unsigned code[] = {                  /* start: */
        MIPS_MTC0 (15, 31, 0),                  /* move $15 to COP0 DeSave */
        0,                                      /* lui $15, upper_val */
        0,                                      /* ori $15, lower_val */
        0,                                      /* mtlo, mthi or mtc0 */
        MIPS_B (NEG16(5)),			/* b start */
        MIPS_MFC0 (15, 31, 0),                  /* move COP0 DeSave to $15 */
    };

    if (regno < 32) {
        /* General purpose registers: special case. */
        t->reg [regno] = val;
        code_gpr [0] = MIPS_LUI (regno, UPPER16(val));
        code_gpr [2] = MIPS_ORI (regno, regno, LOWER16(val));
        t->adapter->exec (t->adapter, 1,
            ARRAY_SIZE(code_gpr), code_gpr, 0, 0, 0, 0);
        return;
    }
    code [1] = MIPS_LUI (15, UPPER16(val));
    code [2] = MIPS_ORI (15, 15, LOWER16(val));
    switch (regno) {
    case REG_STATUS:
        code [3] = MIPS_MTC0 (15, CP0_STATUS, 0);
        break;
    case REG_LO:
        code [3] = MIPS_MTLO (15);
        break;
    case REG_HI:
        code [3] = MIPS_MTHI (15);
        break;
    case REG_BADVADDR:
        code [3] = MIPS_MTC0 (15, CP0_BADVADDR, 0);
        break;
    case REG_CAUSE:
        code [3] = MIPS_MTC0 (15, CP0_CAUSE, 0);
        break;
    case REG_DEPC:
        code [3] = MIPS_MTC0 (15, CP0_DEPC, 0);
        break;
    default:
        return;
    }

    t->adapter->exec (t->adapter, 1, ARRAY_SIZE(code), code, 0, 0, 0, 0);
    t->reg [regno] = val;
}

/*
 * Set an instruction breakpoint or a data watchpoint.
 */
void target_add_break (target_t *t, unsigned addr, int type)
{
    int i, control;

    if (type == 'b') {
        /* Instruction breakpoint. */
        if (t->nbpoints <= 0)
            return;

        /* Find free slot. */
        for (i=0; i<t->nbpoints; i++) {
            if (! t->bp_used[i])
                break;
        }
        if (i >= t->nbpoints) {
            /* All breakpoints used.
             * Forget the oldest one. */
            for (i=0; i<t->nbpoints-1; i++) {
                unsigned val = target_read_word (t, EJTAG_IBA(i+1));
                target_write_word (t, EJTAG_IBA(i), val);
            }
            i = t->nbpoints - 1;
        }
        t->bp_used[i] = 1;
        t->bp_value[i] = addr;
        target_write_word (t, EJTAG_IBA(i), addr);
        target_write_word (t, EJTAG_IBM(i), 0x00000000);
        target_write_word (t, EJTAG_IBC(i), DBC_BE);
    } else {
        /* Data watchpoint. */
        if (t->nwatchpoints <= 0)
            return;

        /* Find free slot. */
        for (i=0; i<t->nwatchpoints; i++) {
            if (! t->watch_used[i])
                break;
        }
        if (i >= t->nwatchpoints) {
            /* All watchpoints used.
             * Forget the oldest one. */
            for (i=0; i<t->nwatchpoints-1; i++) {
                unsigned val = target_read_word (t, EJTAG_DBA(i+1));
                target_write_word (t, EJTAG_DBA(i), val);
            }
            i = t->nwatchpoints - 1;
        }

	/* Enable watchpoint, ignore all byte lanes in value register
	 * and exclude both load and store accesses from  watchpoint
	 * condition evaluation. */
	control = DBC_NOSB | DBC_NOLB | DBC_BE | (0xff << DBC_BLM_SHIFT);
        switch (type) {
        case 'r':
            control &= ~DBC_NOLB;
            break;
        case 'w':
            control &= ~DBC_NOSB;
            break;
        case 'a':
            control &= ~(DBC_NOLB | DBC_NOSB);
            break;
	}

        t->watch_used[i] = 1;
        t->watch_value[i] = addr;
        target_write_word (t, EJTAG_DBA(i), addr);
        target_write_word (t, EJTAG_DBM(i), 0x00000000);
        target_write_word (t, EJTAG_DBASID(i), 0x00000000);
        target_write_word (t, EJTAG_DBC(i), control);
        target_write_word (t, EJTAG_DBV(i), 0);
    }
}

/*
 * Clear a breakpoint or watchpoint by address.
 */
void target_remove_break (target_t *t, unsigned addr)
{
    int i;

    for (i=0; i<t->nbpoints; i++) {
        if (t->bp_used[i] && t->bp_value[i] == addr) {
            target_write_word (t, EJTAG_IBC(i), 0);
        }
    }
    for (i=0; i<t->nwatchpoints; i++) {
        if (t->watch_used[i] && t->watch_value[i] == addr) {
            target_write_word (t, EJTAG_DBC(i), 0);
        }
    }
}
